Table of Contents
 Class FoldedPlateData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the folded plate
public class FoldedPlateData
Inheritance
object
FoldedPlateData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Bends
List of bends connected plates of foldedplate
public List<BendData> Bends { get; set; }
Property Value
List<BendData>
 Plates
List of plates belong to folded plate
public List<PlateData> Plates { get; set; }
Property Value
List<PlateData>
 Edit this page